rhobison/esport-fi32/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.3 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_GPIO_CTRL_FUNC_IN_IRAM=y
CONFIG_LWIP_IP_FORWARD=y
CONFIG_LWIP_IPV4_NAPT=y
CONFIG_LWIP_STATS=y
# Increase FreeRTOS timer daemon task stack from the 2048-byte default.
# The session_trk_qualify_timer_cb and session_trk_idle_timer_cb perform
# multiple 64-bit divisions and call esp_event_post + ESP_LOGI with PRId64,
# all of which use substantial stack via software arithmetic routines on
# RISC-V 32-bit.  2048 bytes is insufficient and causes stack overflow,
# which manifests as a Cache access error (MCAUSE=0x19) on ESP32-C6.
# Partition table: custom two-OTA layout (nvs=48K, ota_0=2000K, ota_1=2000K)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# OTA rollback: if new firmware does not call
# esp_ota_mark_app_valid_cancel_rollback(), the bootloader
# reverts to the previous slot on the next boot.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
# Increase ESP timer task stack from 3584-byte default.  device_reg_tick()
# allocates wifi_sta_list_t (~124 bytes) and snapshot arrays on the stack,
# and calls esp_wifi_ap_get_sta_list(), config_mngr_* getters, ESP_LOGI
# formatting, and wifi_mngr_dbg_filter_log().  3584 bytes is too tight and
# causes a stack overflow that corrupts libc mutex state, resulting in an
# abort() inside lock_acquire_generic.
CONFIG_ESP_TIMER_TASK_STACK_SIZE=6144

# Reboot the device if any watchdog-subscribed task is starved long enough to
# trip the task watchdog, instead of only logging.  Combined with the Wi-Fi
# connectivity supervisor this recovers the device from a wedged task that
# would otherwise leave it unreachable for the rest of the session.
CONFIG_ESP_TASK_WDT_PANIC=y

# NAT/port forwarding for reward AP clients sharing the upstream STA link.
CONFIG_LWIP_IPV4_NAPT_PORTMAP=y

# FreeRTOS run-time stats (esp_timer based) power the /telemetry CPU-load and
# per-task diagnostics used to investigate long-uptime behaviour.
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_RUN_TIME_STATS_USING_ESP_TIMER=y

# Crash capture: write an ELF core dump to the dedicated `coredump` flash
# partition on every panic / abort / watchdog so a `other_wdt`/`panic`
# reboot loop in the field can be decoded after the fact with
# `esp-coredump info_corefile` / `dbg_corefile`.  Without this the reset
# reason is the only post-mortem evidence available.  CRC32 keeps the per-crash
# write cost low; the 128K partition holds the task stacks + registers.
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y
CONFIG_ESP_COREDUMP_CHECK_BOOT=y
# Dedicated stack for the coredump handler.  Without this (default=0) the
# handler runs on the panicking task's stack -- which is already corrupted
# when the panic is a FreeRTOS stack-canary violation, causing the write to
# fail silently and leaving the coredump partition empty.
CONFIG_ESP_COREDUMP_STACK_SIZE=4096

